"""FizzBuzz.

Напишите программу, которая печатает цифры от 1 до 100, но вместо чисел,
кратных 3 пишет Fizz, вместо чисел кратный 5 пишет Buzz, а вместо чисел
одновременно кратных и 3 и 5 - FizzBuzz

"""


def fizz_buzz():
    for num in range(1, 101):
        if (num % 3) == 0 and (num % 5) == 0:
            print('FizzBuzz')
        elif num % 3 == 0:
            print('Fizz')
        elif num % 5 == 0:
            print('Buzz')
        else:
            print(num)


if __name__ == '__main__':
    fizz_buzz()
